src/test/resources/templates/QueryInvoiceDigestResponseTemplate.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<ns2:QueryInvoiceDigestResponse xmlns="http://schemas.nav.gov.hu/NTCA/1.0/common" xmlns:ns2="http://schemas.nav.gov.hu/OSA/3.0/api" xmlns:ns3="http://schemas.nav.gov.hu/OSA/3.0/base" xmlns:ns4="http://schemas.nav.gov.hu/OSA/3.0/data">
    <header>
        <requestId>0E0092E8C7EC47A6C74FB2DB3CE6C2</requestId>
        <timestamp>2023-11-12T23:36:16.961Z</timestamp>
        <requestVersion>3.0</requestVersion>
        <headerVersion>1.0</headerVersion>
    </header>
    <result>
        <funcCode>OK</funcCode>
    </result>
    <ns2:software>
        <ns2:softwareId>HU27917882-3241244</ns2:softwareId>
        <ns2:softwareName>Nav polling library</ns2:softwareName>
        <ns2:softwareOperation>LOCAL_SOFTWARE</ns2:softwareOperation>
        <ns2:softwareMainVersion>0.1</ns2:softwareMainVersion>
        <ns2:softwareDevName>Gergely Olivér Szabó</ns2:softwareDevName>
        <ns2:softwareDevContact>szabogergelyoliver@gmail.com</ns2:softwareDevContact>
        <ns2:softwareDevCountryCode>HU</ns2:softwareDevCountryCode>
    </ns2:software>
    <ns2:invoiceDigestResult>
        <ns2:currentPage>1</ns2:currentPage>
        <ns2:availablePage>1</ns2:availablePage>
        <ns2:invoiceDigest>
            <ns2:invoiceNumber>%s</ns2:invoiceNumber>
            <ns2:invoiceOperation>CREATE</ns2:invoiceOperation>
            <ns2:invoiceCategory>NORMAL</ns2:invoiceCategory>
            <ns2:invoiceIssueDate>2021-05-15</ns2:invoiceIssueDate>
            <ns2:supplierTaxNumber>%s</ns2:supplierTaxNumber>
            <ns2:supplierName>Értékesítő Kft</ns2:supplierName>
            <ns2:customerTaxNumber>99887764</ns2:customerTaxNumber>
            <ns2:customerName>Beszerző Kft.</ns2:customerName>
            <ns2:paymentMethod>TRANSFER</ns2:paymentMethod>
            <ns2:paymentDate>2023-12-01</ns2:paymentDate>
            <ns2:invoiceAppearance>PAPER</ns2:invoiceAppearance>
            <ns2:source>MGM</ns2:source>
            <ns2:invoiceDeliveryDate>2021-05-15</ns2:invoiceDeliveryDate>
            <ns2:currency>HUF</ns2:currency>
            <ns2:invoiceNetAmount>5000</ns2:invoiceNetAmount>
            <ns2:invoiceNetAmountHUF>5000</ns2:invoiceNetAmountHUF>
            <ns2:invoiceVatAmount>3000</ns2:invoiceVatAmount>
            <ns2:invoiceVatAmountHUF>3000</ns2:invoiceVatAmountHUF>
            <ns2:transactionId>kjahsjkhag</ns2:transactionId>
            <ns2:index>1</ns2:index>
            <ns2:insDate>2021-05-15T12:20:33Z</ns2:insDate>
            <ns2:completenessIndicator>false</ns2:completenessIndicator>
        </ns2:invoiceDigest>
    </ns2:invoiceDigestResult>
</ns2:QueryInvoiceDigestResponse>